In [1]:
import pandas as pd

In [3]:
df=pd.read_csv("test.csv")

*how big is the data*

In [7]:
df.shape

(5, 15)

*how does the data look like*

In [9]:
df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14
0,0,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
1,1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0
2,2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0
3,3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1
4,4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0

*what is the data type of cols*

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   5 non-null      int64
 1   Unnamed: 1   5 non-null      object
 2   Unnamed: 2   5 non-null      object
 3   Unnamed: 3   5 non-null      object
 4   Unnamed: 4   3 non-null      object
 5   Unnamed: 5   5 non-null      object
 6   Unnamed: 6   4 non-null      object
 7   Unnamed: 7   5 non-null      object
 8   Unnamed: 8   5 non-null      object
 9   Unnamed: 9   5 non-null      object
 10  Unnamed: 10  3 non-null      object
 11  Unnamed: 11  4 non-null      object
 12  Unnamed: 12  5 non-null      object
 13  Unnamed: 13  5 non-null      object
 14  Unnamed: 14  5 non-null      object
dtypes: int64(1), object(14)
memory usage: 732.0+ bytes

*Are there any missing values?*

In [11]:
df.isnull().sum()

Unnamed: 0     0
Unnamed: 1     0
Unnamed: 2     0
Unnamed: 3     0
Unnamed: 4     2
Unnamed: 5     0
Unnamed: 6     1
Unnamed: 7     0
Unnamed: 8     0
Unnamed: 9     0
Unnamed: 10    2
Unnamed: 11    1
Unnamed: 12    0
Unnamed: 13    0
Unnamed: 14    0
dtype: int64

*How does the data look mathematically?*

In [12]:
df.describe()

       Unnamed: 0
count    5.000000
mean     2.000000
std      1.581139
min      0.000000
25%      1.000000
50%      2.000000
75%      3.000000
max      4.000000

* Are there duplicate values?*

In [13]:
df.duplicated().sum()

np.int64(0)

*How is the correlation between cols?*

In [18]:
df.corr

<bound method DataFrame.corr of    Unnamed: 0   Unnamed: 1 Unnamed: 2              Unnamed: 3 Unnamed: 4  \
0           0  enrollee_id       city  city_development_index     gender
1           1        29725    city_40                   0.776       Male
2           2        11561    city_21                   0.624        NaN
3           3        33241   city_115                   0.789        NaN
4           4          666   city_162                   0.767       Male

                Unnamed: 5           Unnamed: 6       Unnamed: 7  \
0      relevent_experience  enrolled_university  education_level
1   No relevent experience        no_enrollment         Graduate
2   No relevent experience     Full time course         Graduate
3   No relevent experience                  NaN         Graduate
4  Has relevent experience        no_enrollment          Masters

         Unnamed: 8  Unnamed: 9   Unnamed: 10     Unnamed: 11   Unnamed: 12  \
0  major_discipline  experience  company_size    company_type  last_new_job
1              STEM          15         50-99         Pvt Ltd            >4
2              STEM           5           NaN             NaN         never
3   Business Degree          <1           NaN         Pvt Ltd         never
4              STEM         >20         50-99  Funded Startup             4

      Unnamed: 13 Unnamed: 14
0  training_hours      target
1              47           0
2              83           0
3              52           1
4               8           0  >

In [19]:
df.corr()[' experience']

ValueError: could not convert string to float: 'enrollee_id'